iops/mini1-fio.out
rwxrob@mini1:~$ sudo fio --rw=write --ioengine=sync --fdatasync=1 --directory=foo --size=22m --bs=2300 --name=foo
foo: (g=0): rw=write, bs=(R) 2300B-2300B, (W) 2300B-2300B, (T) 2300B-2300B, ioengine=sync, iodepth=1
fio-3.28
Starting 1 process
foo: Laying out IO file (1 file / 22MiB)
Jobs: 1 (f=1): [W(1)][100.0%][w=56KiB/s][w=25 IOPS][eta 00m:00s]
foo: (groupid=0, jobs=1): err= 0: pid=29933: Fri Sep 23 15:50:49 2022
  write: IOPS=27, BW=62.6KiB/s (64.1kB/s)(22.0MiB/360053msec); 0 zone resets
    clat (usec): min=28, max=205, avg=63.60, stdev=11.91
     lat (usec): min=28, max=207, avg=65.01, stdev=11.94
    clat percentiles (usec):
     |  1.00th=[   50],  5.00th=[   52], 10.00th=[   53], 20.00th=[   53],
     | 30.00th=[   55], 40.00th=[   55], 50.00th=[   68], 60.00th=[   69],
     | 70.00th=[   69], 80.00th=[   71], 90.00th=[   75], 95.00th=[   77],
     | 99.00th=[  104], 99.50th=[  127], 99.90th=[  165], 99.95th=[  172],
     | 99.99th=[  200]
   bw (  KiB/s): min=    8, max=   76, per=99.10%, avg=62.20, stdev= 6.50, samples=719
   iops        : min=    4, max=   34, avg=27.86, stdev= 2.89, samples=719
  lat (usec)   : 50=1.05%, 100=97.76%, 250=1.20%
  fsync/fdatasync/sync_file_range:
    sync (msec): min=13, max=436, avg=35.82, stdev=15.12
    sync percentiles (msec):
     |  1.00th=[   15],  5.00th=[   17], 10.00th=[   19], 20.00th=[   22],
     | 30.00th=[   24], 40.00th=[   28], 50.00th=[   38], 60.00th=[   41],
     | 70.00th=[   44], 80.00th=[   47], 90.00th=[   56], 95.00th=[   59],
     | 99.00th=[   67], 99.50th=[   78], 99.90th=[  134], 99.95th=[  157],
     | 99.99th=[  174]
  cpu          : usr=0.10%, sys=0.83%, ctx=30094, majf=0, minf=12
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10029,0,0 short=10029,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=62.6KiB/s (64.1kB/s), 62.6KiB/s-62.6KiB/s (64.1kB/s-64.1kB/s), io=22.0MiB (23.1MB), run=360053-360053msec

Disk stats (read/write):
    dm-0: ios=0/42622, merge=0/0, ticks=0/358100, in_queue=358100, util=100.00%, aggrios=0/31371, aggrmerge=0/11268, aggrticks=0/357493, aggrin_queue=709004, aggrutil=100.00%
  sda: ios=0/31371, merge=0/11268, ticks=0/357493, in_queue=709004, util=100.00%